using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ConsoleApplication3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.CursorVisible = false;
            
            int[,] maze = new int[,]     //Паттерн лабиринта
            {
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
{1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,0,1,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1},
{1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,1,1,0,1,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1},
{1,0,0,0,1,0,1,1,1,1,1,1,1,0,1,0,1,0,0,0,0,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1},
{1,0,1,0,1,0,1,0,0,0,0,0,1,0,1,0,1,0,1,0,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1},
{1,0,1,0,1,0,1,1,0,1,1,1,1,0,1,0,1,0,1,0,0,0,0,0,1,0,0,1,0,1,1,1,1,1,1,1,1,0,1},
{1,0,1,0,1,0,1,1,0,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,0,0,1,0,1,0,0,0,0,0,0,1,0,1},
{1,0,1,0,1,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,1,0,0,0,1,0,1},
{1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1,1,1,1,0,1,0,0,0,1,0,1,0,0,1,1,0,0,1,0,1},
{1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,1,0,1,0,1,1,1,0,1,1,0,0,1,0,0,1,0,1},
{1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,0,0,1,0,1,0,1,0,0,0,0,1,0,0,1,0,0,1,0,1},
{1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,0,1,0,1,0,1,0,0,1,0,1,0,0,1,0,0,1,0,1},
{1,0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,0,1,0,0,1,0,1,0,1,0,0,1,0,1,1,0,1,1,0,1,0,1},
{1,0,1,0,0,0,0,1,0,1,0,1,0,1,1,0,1,0,1,0,0,1,0,1,1,1,0,0,1,0,1,1,0,0,1,0,1,0,1},
{1,0,1,0,1,1,0,1,0,0,0,1,0,1,1,0,0,0,0,0,0,1,0,0,0,0,0,1,1,0,1,1,0,0,1,0,1,0,1},
{1,0,1,0,1,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,0,0},
{1,0,0,0,1,1,0,1,0,1,0,1,0,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,1,0,1,1,0,0,1,0,1,1,1},
{1,0,1,0,1,1,0,0,0,0,0,0,0,1,1,0,1,0,1,1,0,0,0,0,1,0,1,0,1,0,1,1,0,0,1,0,0,0,1},
{1,0,1,0,1,1,0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1},
{1,0,1,0,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,1},
{1,0,1,0,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,1,0,0,0,1,0,1,0,0,0,1,1,1,1,0,0,1,0,1},
{1,0,1,0,1,1,0,1,0,1,1,1,0,1,1,0,0,0,1,1,1,1,1,1,1,0,1,0,1,0,0,1,0,1,0,0,1,0,1},
{1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,1,0,0,1,0,1,0,0,1,0,1},
{1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,0,1,1,1,1,0,1,1,1,1,0,1},
{1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}



            };
            
            int x = 1, y = 1; //Х и У - координаты Игрока
            int i = 0;
            int j = 0;
            Console.WriteLine("Вам исполнилось 18, а по законам племени Варваров (где вы сейчас и живете) - при достижении совершенолетия, юноша обязан пройти испытание духа" +
                "\nЛабиринт является одним из этих испытаний" +
                "\n" +
                "\nВ кромешной темноте, вам нужно найти выход!");
            Console.WriteLine();
            Console.WriteLine();
            Console.WriteLine("\nВ любой момент времени, вы можете сдаться нажав на клавишу Esc");
            Console.WriteLine("\nНажмите на любую клавишу что-бы начать...");
            Console.ReadKey();

            try 
            {
                
                while (true)  //Прорисовка Лабиринта путем бесконечно цикла
                {
                    Console.Clear(); 
                    
                    
                    for ( i = 0; i < maze.GetLength(0); i++)
                    {
                        for ( j = 0; j < maze.GetLength(1); j++)
                        {
                            if (maze[i, j] == 0) Console.Write(",");
                            if (maze[i, j] == 1) Console.Write("▒");
                        }

                        Console.WriteLine();
                    }


                    Console.CursorLeft = x;
                    Console.CursorTop = y;
                    Console.ForegroundColor = ConsoleColor.White;
                    Console.Write("V");
                    Console.ForegroundColor = ConsoleColor.Gray;
                    Console.BackgroundColor = ConsoleColor.Black;

                    

                    ConsoleKeyInfo ki = Console.ReadKey(); // Обработка управления с клавиатуры
                    if (ki.Key == ConsoleKey.Escape)
                    {
                        Console.Clear();
                        Console.WriteLine("Вы не прошли Первое Испытание Варваров" +
                            "\nПозор ВАМ до конца дней!!");
                        Console.ReadKey();
                        break;

                        
                        
                    
                    }                        

                    if (ki.Key == ConsoleKey.LeftArrow && maze[y, x - 1] == 0) x--;

                    if (ki.Key == ConsoleKey.RightArrow && maze[y, x + 1] == 0) x++;

                    if (ki.Key == ConsoleKey.UpArrow && maze[y - 1, x] == 0) y--;

                    if (ki.Key == ConsoleKey.DownArrow && maze[y + 1, x] == 0) y++;

                    



                }

            }
            catch (System.IndexOutOfRangeException e)
            {
                Console.Clear();
                Console.WriteLine("Поздравляю! Вы прошли первое испытание Варваров!!!");
                Console.ReadKey();
            }




        }
    }
}